<?php

namespace Spatie\Holidays\Countries;

class Myanmar extends Country
{
    public function countryCode(): string
    {
        return 'mm';
    }

    protected function allHolidays(int $year): array
    {
        return [
            'လွတ်လပ်ရေးနေ့' => '01-04',
            'ကရင်နှစ်သစ်ကူးနေ့' => '01-11',
            'ပြည်ထောင်စုနေ့' => '02-12',
            'တောင်သူလယ်သမားနေ့' => '03-02',
            'တပေါင်းလပြည့်နေ့' => '03-24',
            'တပ်မတော်နေ့' => '03-27',
            'မြန်မာနှစ်သစ်ကူးရုံးပိတ်ရက် ၁' => '04-13',
            'မြန်မာနှစ်သစ်ကူးရုံးပိတ်ရက် ၂' => '04-14',
            'မြန်မာနှစ်သစ်ကူးရုံးပိတ်ရက် ၃' => '04-15',
            'မြန်မာနှစ်သစ်ကူးရုံးပိတ်ရက် ၄' => '04-16',
            'မြန်မာနှစ်သစ်ကူးရုံးပိတ်ရက် ၅' => '04-17',
            'မြန်မာနှစ်သစ်ကူးရုံးပိတ်ရက် ၆' => '04-18',
            'မြန်မာနှစ်သစ်ကူးရုံးပိတ်ရက် ၇' => '04-19',
            'မြန်မာနှစ်သစ်ကူးရုံးပိတ်ရက် ၈' => '04-20',
            'မြန်မာနှစ်သစ်ကူးရုံးပိတ်ရက် ၉' => '04-21',
            'အလုပ်သမားနေ့' => '05-01',
            'ကဆုန်လပြည့်နေ့' => '05-22',
            'အာဇာနည်နေ့' => '07-19',
            'ဝါဆိုလပြည့်နေ့' => '07-20',
            'သီတင်းကျွတ်ရုံးပိတ်ရက် ၁' => '10-16',
            'သီတင်းကျွတ်ရုံးပိတ်ရက် ၂' => '10-17',
            'သီတင်းကျွတ်ရုံးပိတ်ရက် ၃' => '10-18',
            'တန်ဆောင်မုန်းလပြည့်နေ့' => '11-15',
            'အမျိုးသားအောင်ပွဲနေ့' => '11-25',
            'ခရစ်စမတ်နေ့' => '12-25',
        ];
    }
}
